; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v1 - type_1 ?v2 - type_2)
 	      (pred_3 ?v3 - object ?v2 - type_2)
	      (pred_1 ?v1 - type_1 ?v8 - type_3)
	      (pred_2 ?v1 - type_1 ?v3 - object ?v8 - type_3))

   (:action op_2
       :parameters  (?v1 - type_1 ?v4 ?v6 - type_2)
       :precondition (and  (pred_4 ?v1 ?v4))
       :effect (and  (pred_4 ?v1 ?v6)
		     (not (pred_4 ?v1 ?v4))))

   (:action op_1
       :parameters (?v1 - type_1 ?v7 - object ?v5 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_3 ?v7 ?v5) (pred_4 ?v1 ?v5) (pred_1 ?v1 ?v8))
       :effect (and (pred_2 ?v1 ?v7 ?v8)
		    (not (pred_3 ?v7 ?v5)) 
		    (not (pred_1 ?v1 ?v8))))

   (:action op_3
       :parameters (?v1 - type_1 ?v7 - object ?v5 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v7 ?v8) (pred_4 ?v1 ?v5))
       :effect (and (pred_3 ?v7 ?v5)
		    (pred_1 ?v1 ?v8)
		    (not (pred_2 ?v1 ?v7 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_05 obj_09 - type_1
obj_03 obj_06 obj_01 obj_04 - type_3
obj_12 obj_08 obj_02 - type_2
obj_11 obj_10 obj_07 - object)
(:init
(pred_4 obj_05 obj_12)
(pred_1 obj_05 obj_03)
(pred_1 obj_05 obj_06)
(pred_4 obj_09 obj_08)
(pred_1 obj_09 obj_01)
(pred_1 obj_09 obj_04)
(pred_3 obj_11 obj_02)
(pred_3 obj_10 obj_12)
(pred_3 obj_07 obj_12)
)
(:goal
(and
(pred_3 obj_11 obj_12)
(pred_3 obj_10 obj_12)
(pred_3 obj_07 obj_02)
)
)

(:constraints
  (always (not (pred_4 obj_05 obj_02)))
)
)

; plan
1. (op_1 obj_05 obj_07 obj_12 obj_06)
   deleted: (pred_3 obj_07 obj_12) (pred_1 obj_05 obj_06)
   added: (pred_2 obj_05 obj_07 obj_06)
   goals met: 1 of 3
2. (op_2 obj_09 obj_08 obj_02)
   deleted: (pred_4 obj_09 obj_08)
   added: (pred_4 obj_09 obj_02)
   goals met: 1 of 3
3. (op_1 obj_09 obj_11 obj_02 obj_04)
   deleted: (pred_3 obj_11 obj_02) (pred_1 obj_09 obj_04)
   added: (pred_2 obj_09 obj_11 obj_04)
   goals met: 1 of 3
4. (op_2 obj_09 obj_02 obj_12)
   deleted: (pred_4 obj_09 obj_02)
   added: (pred_4 obj_09 obj_12)
   goals met: 1 of 3
5. (op_3 obj_09 obj_11 obj_12 obj_04)
   deleted: (pred_2 obj_09 obj_11 obj_04)
   added: (pred_3 obj_11 obj_12) (pred_1 obj_09 obj_04)
   goals met: 2 of 3
6. (op_3 obj_05 obj_07 obj_12 obj_06)
   deleted: (pred_2 obj_05 obj_07 obj_06)
   added: (pred_3 obj_07 obj_12) (pred_1 obj_05 obj_06)
   goals met: 2 of 3
7. (op_1 obj_09 obj_07 obj_12 obj_04)
   deleted: (pred_3 obj_07 obj_12) (pred_1 obj_09 obj_04)
   added: (pred_2 obj_09 obj_07 obj_04)
   goals met: 2 of 3
8. (op_2 obj_09 obj_12 obj_02)
   deleted: (pred_4 obj_09 obj_12)
   added: (pred_4 obj_09 obj_02)
   goals met: 2 of 3
9. (op_3 obj_09 obj_07 obj_02 obj_04)
   deleted: (pred_2 obj_09 obj_07 obj_04)
   added: (pred_3 obj_07 obj_02) (pred_1 obj_09 obj_04)
   goals met: 3 of 3
